In [1]:
from sqlalchemy import create_engine

In [2]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [3]:
database_name = 'scooters'
connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [4]:
engine = create_engine(connection_string)

## Scooters Project Questions

Once you've gotten an understanding of what is contained in the available tables, start with addressing these questions:

1. During this period, seven companies offered scooters. How many scooters did each company have in this time frame? Did the number for each company change over time? Did scooter usage vary by company?


2. According to Second Substitute Bill BL2018-1202 (as amended) (https://web.archive.org/web/20181019234657/https://www.nashville.gov/Metro-Clerk/Legislative/Ordinances/Details/7d2cf076-b12c-4645-a118-b530577c5ee8/2015-2019/BL2018-1202.aspx), all permitted operators will first clean data before providing or reporting data to Metro. Data processing and cleaning shall include:

* Removal of staff servicing and test trips
* Removal of trips below one minute
* Trip lengths are capped at 24 hours

Are the scooter companies in compliance with the second and third part of this rule?

3. The goal of Metro Nashville is to have each scooter used a minimum of 3 times per day. Based on the data, what is the average number of trips per scooter per day? Make sure to consider the days that a scooter was available. How does this vary by company? 


4. What is the highest count of scooters being used at the same time? When did it occur? Does this vary by zip code or other geographic region? 4. SUMDs can provide alternative transportation and provide "last mile" access to public transit. How often are trips starting near public transit hubs? You can download a dataset of bus stop locations from https://data.nashville.gov/Transportation/Regional-Transportation-Authority-Bus-Stops/p886-fnbd.

In [5]:
query1_proj=  '''
SELECT companyname, COUNT(DISTINCT sumdid) as scooter_count
from scooters
WHERE sumdgroup ILIKE 'scooter'
GROUP BY companyname;
'''

result1_proj = engine.execute(query1_proj)

In [6]:
scooter_count = pd.read_sql(query1_proj, con = engine, index_col='companyname')
scooter_count.head()

             scooter_count
companyname
Bird                  3860
Bolt                   360
Gotcha                 224
Jump                  1210
Lime                  1818

In [7]:
print(scooter_count)

             scooter_count
companyname
Bird                  3860
Bolt                   360
Gotcha                 224
Jump                  1210
Lime                  1818
Lyft                  1735
Spin                   805

In [8]:
query1a_refined = '''
SELECT companyname, EXTRACT(MONTH from pubdatetime) :: INT AS month_num, COUNT(DISTINCT sumdid)
FROM scooters
GROUP BY companyname, month_num
'''
refined_count_by_month = pd.read_sql(query1a_refined, con=engine)

In [9]:
refined_count_by_month

   companyname  month_num  count
0         Bird          5   3064
1         Bird          6   2910
2         Bird          7   2583
3         Bolt          5    346
4         Bolt          6    333
5         Bolt          7    276
6       Gotcha          5    223
7       Gotcha          6    223
8       Gotcha          7    224
9         Jump          5    976
10        Jump          6   1036
11        Jump          7   1206
12        Lime          5   1632
13        Lime          6   1461
14        Lime          7    903
15        Lyft          5   1376
16        Lyft          6   1152
17        Lyft          7   1026
18        Spin          5    687
19        Spin          6    713
20        Spin          7    570

In [10]:
query1b_proj=  '''
SELECT
    companyname,
    COUNT(DISTINCT triprecordnum) AS trip_rcrds_by_co
FROM trips
GROUP BY companyname;
'''

result1b_proj = engine.execute(query1b_proj)

In [11]:
trip_records_by_co = pd.read_sql(query1b_proj, con = engine, index_col='companyname')
print(trip_records_by_co)

               trip_rcrds_by_co
companyname
Bird                      10868
Bolt Mobility              1232
Gotcha                      187
JUMP                        850
Lime                      50656
Lyft                       3582
SPIN                       1597

In [12]:
query1ba_proj=  '''
with CTE1 AS
    (SELECT
    companyname,
    ROUND(SUM(tripduration), 2) AS sum_trip_dur_by_co
    FROM trips
    GROUP BY companyname)
SELECT companyname, ROUND(sum_trip_dur_by_co / 60, 2) AS sumd_usage_in_hr
FROM trips
JOIN CTE1
USING (companyname)
GROUP BY companyname, sum_trip_dur_by_co, sumd_usage_in_hr;
'''
sumd_usage_in_hr = pd.read_sql(query1ba_proj, con = engine, index_col='companyname')
print(sumd_usage_in_hr)

               sumd_usage_in_hr
companyname
Bird                   34103.37
Bolt Mobility         513691.62
Gotcha                   563.38
JUMP                    3516.69
Lime                   58455.59
Lyft                   32272.83
SPIN                   15009.58

In [13]:
query1bb_proj=  '''

SELECT
    companyname,
    ROUND(SUM(tripduration), 2) AS sum_trip_dur_by_co
FROM trips
GROUP BY companyname;
'''
sumd_usage_in_min = pd.read_sql(query1bb_proj, con = engine, index_col='companyname')
print(sumd_usage_in_min)

               sum_trip_dur_by_co
companyname
Bird                   2046202.00
Bolt Mobility         30821497.00
Gotcha                   33802.78
JUMP                    211001.30
Lime                   3507335.40
Lyft                   1936369.53
SPIN                    900575.00

In [14]:
sumd_usage_pandas_df = pd.DataFrame(sumd_usage_in_min['sum_trip_dur_by_co']/60).round(2)
sumd_usage_pandas_df.rename(columns ={'sum_trip_dur_by_co': 'usage_in_hr'}, inplace=True)
print(sumd_usage_pandas_df)

               usage_in_hr
companyname
Bird              34103.37
Bolt Mobility    513691.62
Gotcha              563.38
JUMP               3516.69
Lime              58455.59
Lyft              32272.83
SPIN              15009.58

In [15]:
query2_proj=  '''
with CTE1 AS
    (SELECT companyname,
    COUNT(tripduration) AS trips_undr_1min
    FROM trips
    WHERE tripduration < 1 
    GROUP BY companyname),
CTE2 as 
    (SELECT companyname,
    COUNT(tripduration) AS  trips_over_24hr
    FROM trips
    WHERE tripduration > 1440
    GROUP BY companyname) 
SELECT companyname, COALESCE(CTE1.trips_undr_1min, 0) AS trips_undr_1min, COALESCE(CTE2.trips_over_24hr, 0) AS  trips_over_24hr
FROM trips
LEFT JOIN CTE1
USING (companyname)
LEFT JOIN CTE2
USING (companyname)
GROUP BY companyname, CTE1.trips_undr_1min, CTE2.trips_over_24hr;
'''

trip_dur_compliance = pd.read_sql(query2_proj, con = engine)
print(trip_dur_compliance)

     companyname  trips_undr_1min  trips_over_24hr
0  Bolt Mobility                0             6908
1           JUMP                0                0
2           Lime              661                0
3         Gotcha                0                0
4           Bird             3963                0
5           SPIN                0               28
6           Lyft             4530                2

In [16]:
query3_prep=  '''
SELECT 
    companyname, EXTRACT(MONTH from pubtimestamp) :: INT AS month_num, EXTRACT(DAY from pubtimestamp) :: INT AS day_num, COUNT(DISTINCT triprecordnum) AS trip_count, COUNT(DISTINCT sumdid) AS sumd_count
FROM trips
GROUP BY companyname, month_num, day_num;
'''
q3_prep = pd.read_sql(query3_prep, con = engine)
print(q3_prep)

    companyname  month_num  day_num  trip_count  sumd_count
0          Bird          5        1        1104         714
1          Bird          5        2        1220         757
2          Bird          5        3        1994         979
3          Bird          5        4        2728        1066
4          Bird          5        5        1987         866
..          ...        ...      ...         ...         ...
523        SPIN          7       28         434         192
524        SPIN          7       29         290         137
525        SPIN          7       30         232         123
526        SPIN          7       31         190         101
527        SPIN          8        1           4           4

[528 rows x 5 columns]

In [17]:
query3_proj=  '''
with CTE1 AS
    (SELECT 
    companyname, EXTRACT(MONTH from pubtimestamp) :: INT AS month_num, EXTRACT(DAY from pubtimestamp) :: INT AS day_num, COUNT(DISTINCT triprecordnum) AS trip_count, COUNT(DISTINCT sumdid) AS sumd_count
    FROM trips
    GROUP BY companyname, month_num, day_num)
SELECT companyname, ROUND(AVG(trip_count) / AVG(sumd_count), 2) AS daily_sumd_trip_avg, ROUND(AVG(trip_count), 2) AS avg_trips_total, ROUND(AVG(sumd_count), 2) AS avg_sumd_total
FROM trips
JOIN CTE1
USING (companyname)
GROUP BY companyname;
'''
avg_trips = pd.read_sql(query3_proj, con = engine)
print(avg_trips)

     companyname  daily_sumd_trip_avg  avg_trips_total  avg_sumd_total
0           Bird                 1.97          1692.73          859.73
1  Bolt Mobility                 2.29           312.07          136.14
2         Gotcha                 2.44            60.22           24.67
3           JUMP                 2.13           131.37           61.80
4           Lime                 3.99          2353.59          590.49
5           Lyft                 3.01          1300.98          432.00
6           SPIN                 2.05           430.97          210.09

In [18]:
q3_prep_df = pd.DataFrame(q3_prep)
print(q3_prep_df)

    companyname  month_num  day_num  trip_count  sumd_count
0          Bird          5        1        1104         714
1          Bird          5        2        1220         757
2          Bird          5        3        1994         979
3          Bird          5        4        2728        1066
4          Bird          5        5        1987         866
..          ...        ...      ...         ...         ...
523        SPIN          7       28         434         192
524        SPIN          7       29         290         137
525        SPIN          7       30         232         123
526        SPIN          7       31         190         101
527        SPIN          8        1           4           4

[528 rows x 5 columns]

In [19]:
q3_prep_groupby_df = q3_prep_df.groupby('companyname')
avg_trip_pandas_df =  pd.DataFrame(q3_prep_groupby_df['trip_count'].mean() / q3_prep_groupby_df['sumd_count'].mean()).round(2)
avg_trip_pandas_df.rename(columns ={0: 'daily_sumd_trip_avg'}, inplace=True)
print(avg_trip_pandas_df)

               daily_sumd_trip_avg
companyname
Bird                          1.97
Bolt Mobility                 2.29
Gotcha                        2.44
JUMP                          2.13
Lime                          3.99
Lyft                          3.01
SPIN                          2.05